tap "azure/kubelogin", "https://github.com/Azure/homebrew-kubelogin"
tap "databricks/tap"
tap "datadog-labs/pack"
tap "hashicorp/tap"
tap "hightouchio/hightouch"
tap "peonping/tap", "https://github.com/PeonPing/homebrew-tap"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Toolchain of the web
brew "biome"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Run arbitrary commands when files change
brew "entr"
# Modern, maintained replacement for ls
brew "eza"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# Easily access your Google Calendar(s) from a command-line
brew "gcalcli"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Manage stacked Git branches
brew "git-spice"
# Render markdown on the CLI
brew "glow"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Kubernetes package manager
brew "helm"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# JSON diff and patch
brew "jd"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Lazier way to manage everything docker
brew "lazydocker"
# LLVM's OpenMP runtime library
brew "libomp"
# Postgres C API library
brew "libpq"
# GNOME XML library
brew "libxml2"
# GUI for vim, made for macOS
brew "macvim", link: false
# Like sed, awk, cut, join & sort for name-indexed data such as CSV
brew "miller"
# Menu-driven communications program
brew "minicom"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Utility for managing network connections
brew "netcat"
# Development kit for the Java programming language
brew "openjdk"
# PostgreSQL syntax beautifier
brew "pgformatter"
# PGP packet visualizer
brew "pgpdump"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Fast, disk space efficient package manager
brew "pnpm"
# Object-relational database system
brew "postgresql@14"
# Object-relational database system
brew "postgresql@17"
# Prettier daemon
brew "prettierd"
# Easily download, build, install, upgrade, and uninstall Python packages
brew "python-setuptools"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful MCP Slack Server with multiple transports and smart history fetch logic
brew "slack-mcp-server"
# Whitespace steganography: coded messages using whitespace
brew "snow"
# SOcket CAT: netcat on steroids
brew "socat"
# Cross-shell prompt for astronauts
brew "starship"
# Opinionated Lua code formatter
brew "stylua"
# Define your dev environment as code. For microservice apps on Kubernetes
brew "tilt"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vulnerability scanner for container images, file systems, and Git repos
brew "trivy"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Syntax-aware linter for prose
brew "vale"
# Simple terminal image viewer written in Rust
brew "viu"
# JavaScript toolchain manager for reproducible environments
brew "volta"
# Executes a program periodically, showing output fullscreen
brew "watch"
# CLI for Git worktree management, designed for parallel AI agent workflows
brew "worktrunk"
# XML command-line utilities
brew "xmlstarlet"
# Command-line XML and HTML beautifier and content extractor
brew "xq"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Command-line interface for 1Password
cask "1password-cli"
# Enable Windows-like alt-tab
cask "alt-tab"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# Meslo LG Nerd Font (patched with dev icons/glyphs)
cask "font-meslo-lg-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Utility to hide menu bar items
cask "hiddenbar"
# Menu bar calendar
cask "itsycal"
# Screenshot and annotation tool
cask "ksnip"
# Clipboard manager
cask "maccy"
# Text editor
cask "macvim-app"
# Neovim Client
cask "neovide-app"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Finder Toolbar app to open the current directory in Terminal or Editor
cask "openinterminal"
# Replacement for Docker Desktop
cask "orbstack"
# Administration and development platform for PostgreSQL
cask "pgadmin4"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
cask "slack"
cask "visual-studio-code"
vscode "anthropic.claude-code"
vscode "anysphere.cursorpyright"
vscode "anysphere.remote-ssh"
vscode "biomejs.biome"
vscode "datadog.datadog-vscode"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "gruntfuggly.todo-tree"
vscode "johnpapa.vscode-peacock"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.vscode-typescript-next"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "orta.vscode-jest"
vscode "streetsidesoftware.code-spell-checker"
vscode "sumneko.lua"
vscode "typescriptteam.native-preview"
vscode "usernamehw.errorlens"
vscode "vitest.explorer"
vscode "vscodevim.vim"
npm "corepack"
